# Напишете скрипт, който получава задължителен първи позиционен параметър – директория и незадължителен втори – число. Скриптът трябва да проверява подадената директория и нейните под-директории и да извежда имената на:
#     а) при подаден на скрипта втори параметър – всички файлове с брой hardlink-ове поне равен на параметъра;
#     б) при липса на втори параметър – всички symlink-ове с несъществуващ destination (счупени symlinkове).
# Забележка:За удобство приемаме, че ако има подаден втори параметър, то той е число.


#!/bin/bash

if [[ ${#} -lt 1 ]]; then 
    echo "No arguments in the input!"
    exit 1
fi 

dir="${1}"

if [[ ! -d "${dir}" ]]; then 
    echo "The argument is not a directory!"
    exit 2
fi

shift

if [[ ${#} -eq 0 ]]; then 
    find "${dir}" -xtype l 2>/dev/null
else
    find "${dir}" -type f -links +"$((${1} - 1))" 2>/dev/null
fi
